# 6. В программе генерируется случайное целое число от 0 до 100. Пользователь должен его отгадать не более чем за 10
# попыток. После каждой неудачной попытки должно сообщаться, больше или меньше введенное пользователем число, чем то,
# что загадано. Если за 10 попыток число не отгадано, вывести ответ.

import random

simp_num = random.randint(0, 100)
x = 0
while True:
    if x > 9:
        print(f"К сожалению Вы не смогли найти число {simp_num}")
        break
    else:
        num = int(input("Введите число: "))
        if num == simp_num:
            print("Winner")
            break
        else:
            x += 1
            if num > simp_num:
                print("Нужно ввести число поменьше")
            else:
                print("Нужно число побольше")
