# 1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа. Числа и знак операции
# вводятся пользователем. После выполнения вычисления программа не завершается, а запрашивает новые данные для вычислений.
# Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.
# Если пользователь вводит неверный знак (не '0', '+', '-', '', '/'),
# программа должна сообщать об ошибке и снова запрашивать знак операции.
# Также она должна сообщать пользователю о невозможности деления на ноль, если он ввел его в качестве делителя.

while True:
    x1 = int(input("Введите первое число: "))
    x2 = int(input("Введите второе число: "))
    sign = str(input("Введите знак: "))
    if sign == "0":
        break
    elif sign == "+":
        result = x1 + x2
    elif sign == "*":
        result = x1 * x2
    elif sign == "-":
        result = x1 - x2
    elif sign == "/":
        if x2 != 0:
            result = x1 / x2
        else:
            print("Деление на ноль здесь не делаем")
            continue
    else:
        print("Можно только складывать, вычитать, делить и умножеть")
        continue
    print(result)
